Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: This is especially useful when using library functions, for which you do not have a tags file.
es_es: Esto es especialmente útil cuando se utilizan las funciones de la biblioteca para el que no tiene un archivo de etiquetas.

source: Since a program is structured, Vim can recognize items in it.
es_es: Debido a que un programa está estructurado, Vim puede reconocer elementos en él.

source: Specific commands can be used to move around.
es_es: Puede usar órdenes específicas para desplazarse.

source: C programs often contain constructs like this:
es_es: Los programas en C habitualmente contienen construcciones como esta:

source: But then much longer, and possibly nested.
es_es: Pero también más largo, y posiblemente anidado.

source: Position the cursor on the "#ifdef" and press %.
es_es: Posicione el cursor sobre «#ifdef» y pulse «%».

source: Vim will jump to the "#else".
es_es: Vim saltará al siguiente «#else».

source: Pressing % again takes you to the "#endif".
es_es: Pulsar «%» otra vez le devuelve a «#endif».

source: Another % takes you to the "#ifdef" again.
es_es: Otro «%» le llevaría a «#ifdef» otra vez.

source: When the construct is nested, Vim will find the matching items.
es_es: Cuando una construcción está anidada, Vim encontrará los elementos coincidentes.

source: This is a good way to check if you didn't forget an "#endif".
es_es: Esta es una buena forma de comprobar si se ha olvidado de insertar un «#endif».

source: When you are somewhere inside a "#if" - "#endif", you can jump to the start of it with: >
es_es: Cuando está en algún punto dentro de un «#if - #endif», puede saltar al principio con lo siguiente: >

source: If you are not after a "#if" or "#ifdef" Vim will beep.
es_es: Si no está después de un «#if» o «#ifdef» Vim emitirá un sonido.

source: To jump forward to the next "#else" or "#endif" use: >
es_es: Para saltar hacia adelante al siguiente «#else» o «#endif» use lo siguiente: >

source: These two commands skip any "#if" - "#endif" blocks that they encounter.
es_es: Estas dos órdenes omiten cualquier bloque «#if - #endif» que se encuentran.

source: With the cursor in the last line, "[#" moves to the first line.
es_es: Con el cursor en la última línea, «[#» le lleva a la primera línea.

source: The "#ifdef" - "#endif" block in the middle is skipped.
es_es: El bloque «#ifdef - #endif» en el centro se omite.

source: In C code blocks are enclosed in {}.
es_es: Los bloques de código C están limitados por {}.

source: These can get pretty long.
es_es: Esto puede ser muy largo.

source: To move to the start of the outer block use the "[[" command.
es_es: Para saltar al principio del bloque exterior use la orden «[[».

source: Use "][" to find the end.
es_es: Use «][» para encontrar el final.

source: This assumes that the "{" and "}" are in the first column.
es_es: Esto supone que «{» y «}» están en la primera columna.

source: The "[{" command moves to the start of the current block.
es_es: La orden «[{» le lleva al principio del bloque actual.

source: It skips over pairs of {} at the same level.
es_es: Omite las parejas de «{}» en el mismo nivel.

source: "]}" jumps to the end.
es_es: «]}» salta al final.

source: An overview:
es_es: Una vista general:

source: When writing C++ or Java, the outer {} block is for the class.
es_es: Al escribir en C++ o Java, el bloque exterior «{}» es para la clase.

source: The next level of {} is for a method.
es_es: El siguiente nivel de «{}» es para un método.

source: When somewhere inside a class use "[m" to find the previous start of a method.
es_es: Si se encuentra dentro de una clase, use «[m» para encontrar el inicio previo de un método.

source: "]m" finds the next start of a method.
es_es: «]m» encuentra el siguiente inicio de un método.

source: Additionally, "[]" moves backward to the end of a function and "]]" moves forward to the start of the next function.
es_es: Además, «[]» se mueve hacia atrás al final de la función, y «]]» se mueve hacia adelante, al inicio de la siguiente función.

source: The end of a function is defined by a "}" in the first column.
es_es: El final de la función está definido con un «}» al principio de la primera columna.

source: Don't forget you can also use "%" to move between matching (), {} and [].
es_es: No se olvido de que también puede usar «%» para desplazarase entre parejas de «()», «{}» y «[]».

source: That also works when they are many lines apart.
es_es: También funciona cuando están separados por varias líneas.

source: The "[(" and "])" commands work similar to "[{" and "]}", except that they work on () pairs instead of {} pairs.
es_es: Las órdenes «[(» y «])» funcionan de manera similar a «[{» y «]}», con la excepción de que funcionan con parejas de «()» en lugar de «{}».

source: To move back to the start of a comment use "[/".
es_es: Use «[/» para volver al principio de un comentario.

source: Move forward to the end of a comment with "]/".
es_es: Puede moverse hacia adelante al final de un comentario con «]/».

source: This only works for /* - */ comments.
es_es: Sólo funciona con comentarios /* - */.

source: +-> +-> /* | [/ | * A comment about --+ [/ | +-- * wonderful life.
es_es: +-> +-> /* | [/ | * Comentario sobre la --+ [/ | +-- * maravillosa vida.

source: | ]/ | */ <-+ | +-- foo = bar * 3; --+ | ]/ /* a short comment */ <-+
es_es: | ]/ | */ <-+ | +-- foo = bar * 3; --+ | ]/ /* Comentario corto */ <-+

source: Vim will list the matching lines it can find.
es_es: VIM enumerará las líneas coincidentes que puede encontrar.

source: Not only in the current file, but also in all included files (and files included in them, etc.).
es_es: No sólo en el archivo actual, sino también en todos los archivos incluidos (y archivos incluidos en ellos, etc..).

source: Vim will find included files in the places specified with the 'path' option.
es_es: Vim encontrará ficheros incluidos en los lugares definidos con la opción 'path'.

source: If a directory is missing, some include files will not be found.
es_es: Si falta un directorio puede que no se encuentren todos los archivos incluidos.

source: You can discover this with this command: >
es_es: Puede descubrirlo con la siguiente orden: >

source: It will list the include files that could not be found.
es_es: Esto lista todos los archivos incluidos que no pudo encontrar.

source: Also files included by the files that could be found.
es_es: También incluye archivos incluidos por los ficheros no encontrados.

source: An example of the output:
es_es: Un ejemplo de la salida:

source: The "io.h" file is included by the current file and can't be found.
es_es: El archivo «io.h» está incluido en el archivo actual y no se puede encontrar.

source: "vim.h" can be found, thus ":checkpath" goes into this file and checks what it includes.
es_es: Se puede encontrar «vim.h», y por ello «:checkpath» acude a ese archivo y compruebe qué incluye.

source: The "functions.h" and "clib/exec_protos.h" files, included by "vim.h" are not found.
es_es: Los archivos «functions.h» y «clib/exec_protos.h», incluidos por «vim.h» no se pueden encontrar.

source: Note: Vim is not a compiler.
es_es: Nota: Vim no es un compilador.

source: It does not recognize "#ifdef" statements.
es_es: No reconoce las declaraciones «#ifdef».

source: This means every "#include" statement is used, also when it comes after "#if NEVER".
es_es: Esto significa que se usa cada declaración «#include», incluso si aparece después de «#if NEVER».

source: To fix the files that could not be found, add a directory to the 'path' option.
es_es: Para arreglar los archivo no encontrados, añada el directorio a la opción 'path'.

source: A good place to find out about this is the Makefile.
es_es: Un buen sitio para averiguar esto es el archivo «Makefile».

source: Look out for lines that contain "-I" items, like "-I/usr/local/X11".
es_es: Busque líneas que contengan elementos «-I», como «-I/usr/local/X11».

source: To add this directory use: >
es_es: Use los siguiente para añadir este directorio: >

source: When there are many subdirectories, you can use the "*" wildcard.
es_es: Puede usar el comodín «*» cuando haya varios directorios.

source: When working on a project with a whole nested tree of included files, the "**" items is useful.
es_es: Los elementos «**» son de utilidad cuando trabaja en un proyecto con un árblo anidado de archivos incluidos.

source: This will search down in all subdirectories.
es_es: Esto busca en todos los subdirectorios.

source: There are even more possibilities.
es_es: Hay incluso más posibilidades.

source: Check out the 'path' option for info.
es_es: Para más información consulte la opción 'path'.

source: If you want to see which included files are actually found, use this command: >
es_es: Use la siguiente orden si desea ver qué archivos incluidos se encontraron: >

source: You will get a (very long) list of included files, the files they include, and so on.
es_es: Obtendrá un lista muy larga de los archivos incluidos, los que éstos incluyen, y así sucesivamente.

source: To shorten the list a bit, Vim shows "(Already listed)" for files that were found before and doesn't list the included files in there again.
es_es: Para acortar la lista Vim muestra «Ya está listado» para los archivos encontrados anteriormente, y no muestra los ficheros incluidos nuevamente.

source: "[I" produces a list with only one line of text.
es_es: «[I» produce una lista con una sola línea de texto.

source: When you want to have a closer look at the first item, you can jump to that line with the command: >
es_es: Cuando desee ver el primer elemento, salte a esa línea con la siguiente orden: >

source: The list that "[I" produces has a number at the start of each line.
es_es: La lista que «[I» produce tiene un número al principio de la línea.

source: When you want to jump to another item than the first one, type the number first: >
es_es: Cuando desee saltar a otro elemento distinto al primero, primero introduzca el número:

source: Will jump to the third item in the list.
es_es: Esto salta al tercer elemento de la lista.

source: Remember that you can use CTRL-O to jump back to where you started from.
es_es: Recuerde que puede usar «CTRL-O» para volver al punto desde donde empezó.

source: The "[I" command finds any identifier.
es_es: La orden «[I» encuentra cualquier identificador.

source: To find only macros, defined with "#define" use: >
es_es: Si sólo desea usar macros definidos con «#define» use lo siguiente: >

source: The "[I" command searches included files.
es_es: La orden «[I» busca archivos incluidos.

source: To search in the current file only, and jump to the first place where the word under the cursor is used: >
es_es: Use lo siguiente para buscar sólo en el archivo actual y saltar al primer sitio donde se usa la palabra bajo el cursor: >

source: This will go back to the start of the current function and find the first occurrence of the word under the cursor.
es_es: Esto volvería al principio de la función actual, y buscará la primera aparición de la palabra bajo el cursor.

source: Actually, it searches backwards to an empty line above a "{" in the first column.
es_es: En realidad, busca en sentido inverso una línea vacía sobre un «{» en la primera columna.

source: From there it searches forward for the identifier.
es_es: A partir de ahí, busca hacia adelante el identificador.

source: Example (cursor on "idx"):
es_es: Ejemplo (cursor sobre «idx»):

source: *usr_40.txt* For Vim version 7.3.
es_es: *usr_40.esx* Para Vim version 7.3.

source: A simple mapping was explained in section |05.3|.
es_es: En la sección |05.3| se explicaba una macro («mapping») sencilla.

source: The principle is that one sequence of key strokes is translated into another sequence of key strokes.
es_es: El principio es que una secuencia de pulsaciones de tecla se traduce a otra secuencia de pulsaciones de tecla.

source: This is a simple, yet powerful mechanism.
es_es: Es un mecanismo sencillo pero poderoso.

source: The simplest form is that one key is mapped to a sequence of keys.
es_es: La forma más simple es asignar una tecla a una secuencia de teclas.

source: Since the function keys, except <F1>, have no predefined meaning in Vim, these are good choices to map.
es_es: Debido a que las teclas de función, a excepción de <F1>, no tienen un significado predefinido para Vim, son buenas candidatas para definir macros.

source: This shows how three modes are used.
es_es: Este ejemplo muestra como usar tres modos.

source: After going to the last line with "G", the "o" command opens a new line and starts Insert mode.
es_es: Después de ir a la última línea con «G», la orden «o» crea una nueva línea e inicia el modo Insertar.

source: The text "Date: " is inserted and <Esc> takes you out of insert mode.
es_es: Se inserta el texto «Date:», y <Esc> abandona el modo de inserción.

source: Notice the use of special keys inside <>.
es_es: Tenga en cuenta el uso de teclas especiales dentro de <>.

source: This is called angle bracket notation.
es_es: Se llama notación de corchetes agudos.

source: You type these as separate characters, not by pressing the key itself.
es_es: Los teclea como caracteres distintos, y no pulsando la tecla referida.

source: This makes the mappings better readable and you can copy and paste the text without problems.
es_es: Esto hace que las macros sean más legibles, permitiendo copiar y pegar el texto de la misma sin problema.

source: The ":" character takes Vim to the command line.
es_es: El carácter «:» inicia la línea de órdenes de Vim.

source: The ":read !date" command reads the output from the "date" command and appends it below the current line.
es_es: La orden «:read !date» lee la salida de la orden «date» y la añade bajo la línea actual.

source: The <CR> is required to execute the ":read" command.
es_es: El <CR> se requiere para ejecutar la orden «:read».

source: At this point of execution the text looks like this:
es_es: En este punto, el texto tiene el siguiente aspecto:

source: Now "kJ" moves the cursor up and joins the lines together.
es_es: Ahora «kJ» desplaza el cursor hacia arriba y une las líneas.

source: To decide which key or keys you use for mapping, see |map-which-keys|.
es_es: Para decidir qué teclas usar para las macros, consulte |map-which-keys|.

source: The ":map" command defines remapping for keys in Normal mode.
es_es: La orden «:map» define una macro a usar en modo Normal.

source: You can also define mappings for other modes.
es_es: También puede definir macros para otros modos.

source: For example, ":imap" applies to Insert mode.
es_es: Por ejemplo, «imap» afecta al modo Insertar.

source: You can use it to insert a date below the cursor: >
es_es: Puede usarlo para insertar una fecha bajo el cursor: >

source: It looks a lot like the mapping for <F2> in Normal mode, only the start is different.
es_es: Se parece mucho a la macro para <F2> en modo Normal, sólo el principio es diferente.

source: The <F2> mapping for Normal mode is still there.
es_es: La macro <F2> para el modo Normal aún existe.

source: Thus you can map the same key differently for each mode.
es_es: Puede asignar la misma tecla de forma diferente según el modo.

source: Notice that, although this mapping starts in Insert mode, it ends in Normal mode.
es_es: Tenga en cuenta que, aunque esta macro empieza en el modo Insertar, termina en modo Normal.

source: If you want it to continue in Insert mode, append an "a" to the mapping.
es_es: Si desea continuar en modo Insertar, añada una «a» a la asignación.

source: :map Normal, Visual and Operator-pending :vmap Visual :nmap Normal :omap Operator-pending :map!
es_es: :map Normal, Visual y Operator-pending :vmap Visual :nmap Normal :omap Operator-pending :map!

source: Insert and Command-line :imap Insert :cmap Command-line
es_es: Insertar y Command-line :imap Insertar :cmap Línea de órdenes

source: Operator-pending mode is when you typed an operator character, such as "d" or "y", and you are expected to type the motion command or a text object.
es_es: El modo Operator-pending es cuando introduce un carácter como operador, por ejemplo «y» o «d», y se espera a que introduzca la orden de desplazamiento o un objeto de texto.

source: Thus when you type "dw", the "w" is entered in operator-pending mode.
es_es: Por ello, cuando teclea «dw», la «w» es introducida en el modo Operator-pending

source: Suppose that you want to define <F7> so that the command d<F7> deletes a C program block (text enclosed in curly braces, {}).
es_es: Suponga que desea definir <F7> para que la orden «d<F7>» elimine el bloque de un programa escrito en C (el texto se cierra con llaves, {}).

source: Similarly y<F7> would yank the program block into the unnamed register.
es_es: De forma similar «y<F7>» copiaría el bloque del programa al registro sin nombre.

source: Therefore, what you need to do is to define <F7> to select the current program block.
es_es: Por ello, lo que debe hacer es definir <F7> para seleccionar el bloque actual del programa.

source: You can do this with the following command: >
es_es: La siguiente orden le permite hacer esto: >

source: This causes <F7> to perform a select block "a{" in operator-pending mode, just like you typed it.
es_es: Esto provoca que <F7> realice una selección de bloque «a{» en el modo Operator-pending, justo como lo escribió.

source: This mapping is useful if typing a { on your keyboard is a bit difficult.
es_es: Esta macro es útil si teclear «a{» en su teclado es difícil.

source: The first column of the list shows in which mode the mapping is effective.
es_es: La primera columna de la lista muestra el modo en el que la macro tiene efecto.

source: This is "n" for Normal mode, "i" for Insert mode, etc.
es_es: Esto es, «n» para el modo Normal, «i» para el modo Insertar, etc...

source: A blank is used for a mapping defined with ":map", thus effective in both Normal and Visual mode.
es_es: Se usa un espacio en blanco con las macros definidas mediante «:map», y por ello, con efecto en el modo Visual y Normal.

source: One useful purpose of listing the mapping is to check if special keys in <> form have been recognized (this only works when color is supported).
es_es: Un propósito útil de listar las macros es comprobar si se han reconocido las teclas especiales con la forma <> (sólo funciona con compatibilidad con color).

source: For example, when <Esc> is displayed in color, it stands for the escape character.
es_es: Por ejemplo, cuando <Esc> se muestra en color, simboliza el carácter de escape.

source: When it has the same color as the other text, it is five characters.
es_es: Cuando tiene el mismo color que el resto del texto, simboliza cinco caracteres.

source: The result of a mapping is inspected for other mappings in it.
es_es: El resultado de una macro se inspecciona en busca de otras macros en ella.

source: For example, the mappings for <F2> above could be shortened to: >
es_es: Por ejemplo, las macros para <F2> vistas anteriormente se pueden acortar: >

source: For Normal mode <F2> is mapped to go to the last line, and then behave like <F3> was pressed.
es_es: En modo Normal, <F2> tiene un macro para ir a la última línea, y después comportarse como si se hubiese pulsado <F3>.

source: In Insert mode <F2> stops Insert mode with <Esc> and then also uses <F3>.
es_es: En modo Insertar, <F2> detiene el modo Insertar con <Esc>, y después usa también <F3>.

source: Then <F3> is mapped to do the actual work.
es_es: Por ello, se usa la macro de <F3> para el trabajo real.

source: Suppose you hardly ever use Ex mode, and want to use the "Q" command to format text (this was so in old versions of Vim).
es_es: Suponga que apenas usa el modo Ex, y desea usar la orden «Q» para formatear texto (este era el comportamiento en versiones anteriores de Vim).

source: This mapping will do it: >
es_es: Esta macro realizará esta función: >

source: But, in rare cases you need to use Ex mode anyway.
es_es: Pero, en algunos casos necesita usar el modo Ex.

source: Let's map "gQ" to Q, so that you can still go to Ex mode: >
es_es: Vamos a asignar «gQ» a «Q», para que así pueda ir la modo Ex: >

source: What happens now is that when you type "gQ" it is mapped to "Q".
es_es: Lo que ocurre ahora es que cuando escribe «gQ», se asigna a la «Q».

source: So far so good.
es_es: Por ahora, todo bien.

source: But then "Q" is mapped to "gq", thus typing "gQ" results in "gq", and you don't get to Ex mode at all.
es_es: Pero, a continuación, asigna «Q» a «gq», y por ello escribir «gQ» resulta en «gq», y no entra en modo Ex.

source: To avoid keys to be mapped again, use the ":noremap" command: >
es_es: Para evitar que las claves se asignen otra vez, utilice la orden «:noremap»:

source: Now Vim knows that the "Q" is not to be inspected for mappings that apply to it.
es_es: Ahora Vim sabe que no se puede analizar «Q» en busca de macros que le afecten.

source: There is a similar command for every mode:
es_es: Existe una orden similar para cada modo:

source: :noremap Normal, Visual and Operator-pending :vnoremap Visual :nnoremap Normal :onoremap Operator-pending :noremap!
es_es: :noremap Normal, Visual y Operator-pending :vnoremap Visual :nnoremap Normal :onoremap Operator-pending :noremap!

source: Insert and Command-line :inoremap Insert :cnoremap Command-line
es_es: Insertar y Línea de órdenes :inoremap Insertar :cnoremap Línea de órdenes

source: When a mapping triggers itself, it will run forever.
es_es: Cuando una macro se activa, se ejecutará indefinidamente.

source: This can be used to repeat an action an unlimited number of times.
es_es: Puede usar esto para repetir una acción un número ilimitado de veces.

source: For example, you have a list of files that contain a version number in the first line.
es_es: Por ejemplo, tiene una lista de archivos que contienen un número de versión en la primera línea.

source: You edit these files with "vim *.txt".
es_es: Después, edita estos archivos con «vim.txt».

source: You are now editing the first file.
es_es: Ahora está editando el primer archivo.

source: Define this mapping: >
es_es: Defina esta macro: >

source: To remove a mapping use the ":unmap" command.
es_es: Use la orden «:unmap» para eliminar una macro.

source: Again, the mode the unmapping applies to depends on the command used:
es_es: Una vez más, el modo sobre el que actúa la eliminación de la macro depende de la orden usada:

source: :unmap Normal, Visual and Operator-pending :vunmap Visual :nunmap Normal :ounmap Operator-pending :unmap!
es_es: :unmap Normal, Visual y Operator-pending :vunmap Visual :nunmap Normal :ounmap Operator-pending :unmap!

source: Insert and Command-line :iunmap Insert :cunmap Command-line
es_es: Insertar y Línea de órdenes :iunmap Insertar :cunmap Línea de órdenes

source: There is a trick to define a mapping that works in Normal and Operator-pending mode, but not in Visual mode.
es_es: Dispone de un truco para definir una macro que funciona tanto modo Operator-pending como normal, pero no en modo visual.

source: First define it for all three modes, then delete it for Visual mode: >
es_es: Primero, defina la macro para los tres modos, y después borre la macro del modo Visual: >

source: To remove all mappings use the |:mapclear| command.
es_es: Use la orden |:mapclear| para eliminar todas las macros.

source: You can guess the variations for different modes by now.
es_es: Ahora puede averiguar las variantes según el modo.

source: Be careful with this command, it can't be undone.
es_es: Tenga cuidado con esta orden, ya que su acción no se puede deshacer.

source: The ":map" command can be followed by another command.
es_es: La orden «:map» puede ir seguida de otra orden.
